In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import scipy.stats as stats
import seaborn as sns
from pydataset import data
import acquire

# Data Acquire Exercises

## 1. Use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

print the first 3 rows  
print the number of rows and columns (shape)  
print the column names  
print the data type of each column  
print the summary statistics for each of the numeric variables  
Would you recommend rescaling the data based on these statistics?

In [ ]:
df_iris = data('iris')
df_iris.head(3)

In [ ]:
df_iris.shape

In [ ]:
df_iris.columns

In [ ]:
df_iris.info()

In [ ]:
df_iris.describe()

In [ ]:
# does not look like data needs to be rescaled based on the data, measurements appear to be in comparable units

## 2.Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

assign the first 100 rows to a new dataframe, df_excel_sample  
print the number of rows of your original dataframe  
print the first 5 column names  
print the column names that have a data type of object  
compute the range for each of the numeric variables.

In [ ]:
df_excel_sample = pd.read_excel('Spreadsheets_Exercises_Solutions.xlsx', nrows=100, header=1)
df_excel_sample.head()

In [ ]:
df_excel_sample.shape

In [ ]:
df_excel_sample.iloc[:0, :5]

In [ ]:
df_excel_sample.columns.to_series().groupby(df_excel_sample.dtypes == 'object').groups

In [ ]:
df_excel_sample.describe()

## 3. Read the data from this google sheet into a dataframe, df_google

print the first 3 rows  
print the number of rows and columns  
print the column names  
print the data type of each column  
print the summary statistics for each of the numeric variables  
print the unique values for each of your categorical variables

In [ ]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

In [ ]:
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)
df_google.head(3)

In [ ]:
df_google.shape

In [ ]:
df_google.columns

In [ ]:
df_google.info()

In [ ]:
df_google.describe()

In [ ]:
df_google.nunique()

# Data Prep Exercises

### 1. Iris Data

Use the function defined in acquire.py to load the iris data.  
Drop the species_id and measurement_id columns.  
Rename the species_name column to just species.  
Encode the species name using a sklearn label encoder. Research the inverse_transform method of the label encoder.   How might this be useful?  
Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [ ]:
# Use the function defined in acquire.py to load the iris data
df = acquire.get_iris_data()
df.head()

In [ ]:
# Drop the species_id and measurement_id columns
irisdf = irisdf.drop(columns=['species_id', 'measurement_id'])

In [ ]:
# Rename the species_name column to just species
irisdf = irisdf.rename(columns={'species_name': 'species'})
irisdf.head()

In [ ]:
# encoder = LabelEncoder()

# encoder.fit(train.embark_town)
# train.encoded = encoder.transform(train.embark_town)
# test.encoded = encoder.transform(test.embark_town)

# print(type(train.encoded))
# train.encoded[0:10]

In [ ]:
# this is from the curriculum, but I don't understand how to attach this back to the original df
from sklearn.preprocessing import LabelEncoder

encoder = LabelEncoder()

encoder.fit(irisdf.species)
irisdf.encoded = encoder.transform(irisdf.species)
print(type(irisdf.encoded))
irisdf.encoded

In [ ]:
irisdf.head()

The inverse_transform(y)
Transform labels back to original encoding.

In [ ]:
# this method is from the lesson
#df_dummies = pd.get_dummies(df[['sex', 'embark_town']], drop_first=[True, True])
#df = pd.concat([df, df_dummies], axis=1)

irisdf_dummies = pd.get_dummies(irisdf[['species']], drop_first=True)
irisdf = pd.concat([irisdf, irisdf_dummies], axis=1)
irisdf.head()

In [ ]:
# Create a function named prep_iris that accepts the untransformed iris data, 
# and returns the data with the transformations above applied

def prep_iris(df):
    # Drop the species_id and measurement_id columns
    df = df.drop(columns=['species_id', 'measurement_id'])
    
    # Rename the species_name column to just species
    df = df.rename(columns={'species_name': 'species'})
    
    # encode the species column
    df_dummies = pd.get_dummies(df[['species']], drop_first=True)
    df = pd.concat([df, df_dummies], axis=1)
    
    return df

irisdf = prep_iris(df)

In [ ]:
irisdf.head()

### 2. Titanic Data

Use the function you defined in acquire.py to load the titanic data set.  
Handle the missing values in the embark_town and embarked columns.  
Remove the deck column.  
Use a label encoder to transform the embarked column.  
Scale the age and fare columns using a min max scaler. Why might this be beneficial? When might you not want to do this?  
Fill the missing values in age. The way you fill these values is up to you. Consider the tradeoffs of different methods.  
Create a function named prep_titanic that accepts the untransformed titanic data, and returns the data with the transformations above applied.

In [2]:
# Use the function defined in acquire.py to load the titanic data
df = acquire.get_titanic_data()
df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  891 non-null    int64
 1   survived      891 non-null    int64
 2   pclass        891 non-null    int64
 3   sex           891 non-null    object
 4   age           714 non-null    float64
 5   sibsp         891 non-null    int64
 6   parch         891 non-null    int64
 7   fare          891 non-null    float64
 8   embarked      889 non-null    object
 9   class         891 non-null    object
 10  deck          203 non-null    object
 11  embark_town   889 non-null    object
 12  alone         891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 97.5+ KB

In [4]:
# Drop the embarked and deck columns
df = df.drop(columns=['embarked', 'deck', 'passenger_id'])

In [5]:
# Drop the 2 rows with missing values in embark_town as in lesson
# drop missing observations of embark town
df = df[~df.embark_town.isnull()]

In [6]:
# use the pd.get_dummies as in lesson to encode embark_town column
df_dummies = pd.get_dummies(df[['embark_town']], drop_first=True)
df = pd.concat([df, df_dummies], axis=1)

In [7]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,class,embark_town,alone,embark_town_Queenstown,embark_town_Southampton
0,0,3,male,22.0,1,0,7.2500,Third,Southampton,0,0,1
1,1,1,female,38.0,1,0,71.2833,First,Cherbourg,0,0,0
2,1,3,female,26.0,0,0,7.9250,Third,Southampton,1,0,1
3,1,1,female,35.0,1,0,53.1000,First,Southampton,0,0,1
4,0,3,male,35.0,0,0,8.0500,Third,Southampton,1,0,1

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 12 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   survived                 889 non-null    int64
 1   pclass                   889 non-null    int64
 2   sex                      889 non-null    object
 3   age                      712 non-null    float64
 4   sibsp                    889 non-null    int64
 5   parch                    889 non-null    int64
 6   fare                     889 non-null    float64
 7   class                    889 non-null    object
 8   embark_town              889 non-null    object
 9   alone                    889 non-null    int64
 10  embark_town_Queenstown   889 non-null    uint8
 11  embark_town_Southampton  889 non-null    uint8
dtypes: float64(2), int64(5), object(3), uint8(2)
memory usage: 78.1+ KB

### Transfer functions to prepare.py file

In [ ]:
def prep_titanic(df):
    # Drop the embarked and deck columns
    df = df.drop(columns=['embarked', 'deck', 'passenger_id'])
    
    # drop missing observations of embark town
    df = df[~df.embark_town.isnull()]
    
    # use the pd.get_dummies as in lesson to encode embark_town column
    df_dummies = pd.get_dummies(df[['embark_town']], drop_first=True)
    df = pd.concat([df, df_dummies], axis=1)
    
    # handle missing ages